halfsohappy/qremote/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# TinyUSB — composite device: CDC (serial console) + NCM (USB ethernet).
# CDC carries ESP_LOG output so we can debug over the same USB-C cable
# that provides the network link.
CONFIG_TINYUSB=y
CONFIG_TINYUSB_NET_MODE_NCM=y
CONFIG_TINYUSB_NET_MODE_ECM_RNDIS=n
CONFIG_TINYUSB_NET_MODE_NONE=n
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_MSC_ENABLED=n
CONFIG_TINYUSB_HID_ENABLED=n

# Early boot console goes to UART0 (pre-TinyUSB). Those early messages will
# be lost since the FeatherS3 has no UART bridge — acceptable. After
# tinyusb_driver_install runs, esp_tusb_init_console() redirects stdout/
# stderr to the TinyUSB CDC interface for the rest of the firmware's life.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# lwIP — DHCP server support (we serve the host) and a reasonable socket budget.
CONFIG_LWIP_DHCPS=y
CONFIG_LWIP_IPV4_NAPT=n
CONFIG_LWIP_MAX_SOCKETS=10

# mDNS — let QLab resolve qremote.local.
# We have no WiFi STA/AP — disable their predefined interface slots so our
# custom USB-NCM netif can be registered via mdns_register_netif().
# Without this, mdns_register_netif returns ESP_ERR_NO_MEM (all slots
# reserved for predefined interfaces we don't use).
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_PREDEF_NETIF_STA=n
CONFIG_MDNS_PREDEF_NETIF_AP=n

# Log level — bump if noisy.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
